app/controllers/goods_controller.rb

  def index
    @categories=Good.pluck("category").uniq
    @goods = Good.paginate(page: params[:page])
---
SELECT COUNT(*) FROM "goods"

  def create
    good = Good.create!(goods_params)
    if good.save
---
INSERT INTO "goods" ("name", "brand", "category", "sex", "description", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "goods" SET "updated_at" = ? WHERE "goods"."id" = ?  [["updated_at", "2019-08-08 15:28:15.101864"], ["id", 5]]

  def show
     @good = Good.find(params[:id])
---
SELECT  "goods".* FROM "goods" WHERE "goods"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

  def edit
     @good = Good.find(params[:id])
---
SELECT  "goods".* FROM "goods" WHERE "goods"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    good= Good.find(params[:id])
    good.update_attributes(goods_params)
---
UPDATE "goods" SET "sex" = ?, "updated_at" = ? WHERE "goods"."id" = ?  [["sex", "Female"], ["updated_at", "2019-08-08 17:10:33.953005"], ["id", 1]]

  def destroy
    good=Good.find_by(params[:id])
    good.destroy
---
DELETE FROM "goods" WHERE "goods"."id" = ?  [["id", 1]]