app/controllers/posts_controller.rb

  def index
    @post = Post.new
    @posts = Post.all
---
SELECT "posts".* FROM "posts"

  def create
    @post = Post.new(posts_params)
    if @post.save
---
INSERT INTO "posts" ("author", "headline", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)